//TA_Lab_4_2B_2023.c Робота з динамічною пам’яттю. Дано (rand) цілочислову матрицю А розмірності 
// nxm та координати двох її елементів. Визначити максимальне значення з вказаних чисел. (rand).
#define _CRT_SECURE_NO_WARNINGS
#include <locale.h>
#include <stdio.h>
#include <stdlib.h>
#include <conio.h>
#include <time.h>

int main(void)
{	//Мова консолі українська
	system("chcp 1251");
	setlocale(LC_CTYPE, "ukr");
	system("cls");

	static int i, j;
	int n, m;

	do
	{
		printf("\n Задате кількість рядків (число більше 1) n= ");
		scanf("%d", &n);
		printf(" Задате кількість стовпців (число більше 1) m= ");
		scanf("%d", &m);
		if (n <= 1 && m <= 1) printf("\n Введені некоректні числа, кількість елементів в масиві менше 2. Спробуйте ще раз!");
	} while (n <= 1 && m <= 1);

	// Виділення пам'яті 
	int *a = (int*)malloc(n * m * sizeof(int));
	if (a == NULL)
	{
		printf("Збiй при виділення динамічної памяті для масиву!");
		return 1;
	}

	//Ініціалізація масиву	
	const int Low = -100, High = 100;
	srand((unsigned int)time(NULL));
	for (i = 0; i < n; i++) // цикл по рядках
	{
		for (j = 0; j < m; j++) // цикл по стовпцях

			*(a + i * m + j) = Low + rand() % (High - Low + 1);
	}

	system("cls");
	printf(" Програма визначить максимальний з елементів за заданими вами координатами:\n");
	int n1, m1, n2, m2;
	do
	{
		printf("\n Задайте координати першого елементу А[x1, y1] для порівняння:\n");
		printf("\t - з діапазону від 1 до %d (x1)=", n);
		scanf("%d", &n1);
		printf("\t - з діапазону від 1 до %d (y1)=", m);
		scanf("%d", &m1);
		if (n1<1 || n1>n || m1<1 || m1>m) printf("\n Введене некоректне число! Спробуйте ще раз.");
	} while (n1<1 || n1>n || m1<1 || m1>m);

	do
	{
		printf("\n Задайте координати другого елементу А[x2, y2] для порівняння:\n");
		printf("\t - з діапазону від 1 до %d (x2)=", n);
		scanf("%d", &n2);
		printf("\t - з діапазону від 1 до %d (y2)=", m);
		scanf("%d", &m2);
		if (n2<1 || n2>n || m2<1 || m2>m) printf("\n Введене некоректне число! Спробуйте ще раз.");
	} while (n2<1 || n2>n || m2<1 || m2>m);

	// Виведення елементів масиву
	printf("\n Заданий Вами масив розмірністю А[%d, %d] містить наступні елементи:\n", n, m);
	for (i = 0; i < n; i++)
	{
		for (j = 0; j < m; j++) {
			printf("%5d ", *(a + i * m + j)); // виведення елемента масива
		}
		printf("\n");
	}
	printf("\n Для порівняння ви задали А[%d, %d] = %d;\t А[%d, %d] = %d;\n", n1, m1, (*(a + (n1 - 1)*m + (m1 - 1))), n2, m2, (*(a + (n2 - 1)*m + (m2 - 1))));
	if (*(a + (n1 - 1)*m + (m1 - 1)) < *(a + (n2 - 1)*m + (m2 - 1)))
		printf("\n Серед них більшим є А[%d, %d] = %d;\n", n2, m2, (*(a + (n2 - 1)*m + (m2 - 1))));
	else	printf("\n Серед них більшим є А[%d, %d] = %d;\n", n1, m1, (*(a + (n1 - 1)*m + (m1 - 1))));

	free(a);
	int getch(); getch();
	return (0);
}
